IdeaRS.OpenModel.Loading.LoadImpulse
LoadImpulse

IdeaRS.OpenModel.Loading.LoadImpulse.X
Load in X direction

IdeaRS.OpenModel.Loading.LoadImpulse.Y
Load in Y direction

IdeaRS.OpenModel.Loading.LoadImpulse.Z
Load in Z direction